cask_args appdir: '/Applications'

tap 'homebrew/cask-cask'
tap 'homebrew/cask-versions'

# Install GNU utilities
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'bash-completion'

# brew 'direnv'
brew 'git'
brew 'wget'
# brew 'dos2unix'
brew 'sshrc'
# brew 'pandoc'
# brew 'pstree'
# brew 'tree'
# brew 'nmap'
brew 'imagemagick'
# brew 'spaceman-diff'
# brew 'readline'
brew 'openssl'
brew 'yarn'
brew 'nvm'

brew 'python'
brew 'postgresql'
brew 'redis'
# note - use the "docker for mac" cask
brew 'docker-compose'
# brew 'circleci'

# install user applications
cask 'google-chrome'
# Can't find google-chrome-canary
# cask 'google-chrome-canary'
cask 'docker'
cask 'firefox'
cask 'mactracker'
cask 'slack'
cask 'amethyst'
cask 'visual-studio-code'